package Lesson4.Task2;

import java.time.LocalDateTime;

public class MesengerRuner {
    public static void main(String[] args) {
        Message m1 = new Message("Vlad", LocalDateTime.of(2018, 06, 29, 12, 54), new PlainText("Привет, как дела?"));
        Message m2 = new Message("Egor", LocalDateTime.of(2018, 06, 29, 12, 55), new PlainText("Привет, всё гуд)"));
        Message m3 = new Message("Vlad", LocalDateTime.of(2018, 06, 29, 12, 56), new PlainText("Тест месенджера!"));
        Message m4 = new Message("Egor", LocalDateTime.of(2018, 06, 29, 12, 57), new EmoticonText("ghost"));
        Message m5 = new Message("Vlad", LocalDateTime.of(2018, 06, 29, 12, 58), new EmoticonText("winkin-face"));
        Message m6 = new Message("Egor", LocalDateTime.of(2018, 06, 29, 13, 02), new PicturText("Like"));
        Message m7 = new Message("Vlad", LocalDateTime.of(2018, 06, 29, 13, 10), new PicturText("heart"));

        Dialog d1 = new Dialog();
        d1.addMesseg(m1);
        d1.addMesseg(m2);
        d1.addMesseg(m3);
        d1.addMesseg(m4);
        d1.addMesseg(m5);
        d1.addMesseg(m6);
        d1.addMesseg(m7);

        d1.printDialog();
    }

}

//Message Author = Vlad, datePublic = 2018-06-29T12:54, content =
//Привет, как дела?
//
//Message Author = Egor, datePublic = 2018-06-29T12:55, content =
//Привет, всё гуд)
//
//Message Author = Vlad, datePublic = 2018-06-29T12:56, content =
//Тест месенджера!
//
//Message Author = Egor, datePublic = 2018-06-29T12:57, content =
//👻
//
//Message Author = Vlad, datePublic = 2018-06-29T12:58, content =
//😉
//
//Message Author = Egor, datePublic = 2018-06-29T13:02, content =
//________$$$$
//_______$$__$
//_______$___$$
//_______$___$$
//_______$$___$$
//________$____$$
//________$$____$$$
//_________$$_____$$
//_________$$______$$
//__________$_______$$
//____$$$$$$$________$$
//__$$$_______________$$$$$$
//_$$____$$$$____________$$$
//_$___$$$__$$$____________$$
//_$$________$$$____________$
//__$$____$$$$$$____________$
//__$$$$$$$____$$___________$
//__$$_______$$$$___________$
//___$$$$$$$$$__$$_________$$
//____$________$$$$_____$$$$
//____$$____$$$$$$____$$$$$$
//_____$$$$$$____$$__$$
//_______$_____$$$_$$$
//________$$$$$$$$$$
//
//
//Message Author = Vlad, datePublic = 2018-06-29T13:10, content =
//________$$$$$$$$$$$___________$$$$$$$$$$$$_________
//______$$$$$$$$_____$$$$$___$$$$$$_____$$$$$$$______
//____$$$$$$$_____________$$$______________$$$$$_____
//___$$$$$$$_______________$_________________$$$$____
//__$$$$$$____________________________________$$$$___
//__$$$$$_____________________________________ $$$$__
//_$$$$$______________________________________$$$$$__
//_$$$$$_____________________________________$$$$$$__
//__$$$$$$_________________________________$$$$$$$___
//___$$$$$$$______________________________$$$$$$$____
//_____$$$$$$____________________________$$$$$$______
//_______$$$$$$________________________$$$$$$________
//__________$$$$$_____________________$$$$___________
//_____________$$$$_________________$$$$_____________
//_______________$$$$_____________$$$________________
//_________________$$$_________$$$___________________
//_________________ __$$$_____$$_____________________
//______________________$$__$$_______________________
//________________________$$_________________________